#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>
#include<Windows.h>



//int main()
//{
//	unsigned char i = 0;
//	int count = 0;
//	for (i = 0; i < 255; i++)
//	{
//		printf("hello world\n");
//		count++;
//	}
//	printf("count=%d\n", count);
//	return 0;
//}
// 
// 
//int main()
//{
//	char a[1000];//char数组的范围是-128到127循环
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;//-129相当于127
//					 //-1到-128+127到1后才找到 0 	
//	}					//一共是128+127=255个
//	printf("%d\n", strlen(a));//找\0停止
//	return 0;
//}
// 
// 
// 
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);//#include<Windows.h>

//	}
//
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//
//	return 0;
//}
//10000000000000000000000000010100--- -20原码
//11111111111111111111111111101011--- -20反码
// 
//11111111111111111111111111101100 -- -20补码
//00000000000000000000000000001010---  10补码
// 
//11111111111111111111111111110110----得数的补码
//  
//11111111111111111111111111110101----得数的反码
//10000000000000000000000000001010-----得数的原码
//十进制是-10

//有符号的char的范围是-128到127
//无符号的char的范围是0到255
//
//int main()
//{
//	char a = -128;
//	printf("%u\n", a);
//
//	return 0;
//}
//10000000000000000000000010000000
//11111111111111111111111101111111 
//11111111111111111111111110000000 
//整形提升看a前面的类型
//11111111111111111111111110000000 
// 
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001------原码
//	//11111111111111111111111111111110------反码
//	//11111111111111111111111111111111------补码
//	//截取11111111储存
//	//打印时原码---整形提升
//	//有符号数整形提升补符号位
//	//1111111111111111111111111111111
//	signed char b = -1;
//	//11111111储存
//	//1111111111111111111111111111111
//	unsigned char c = -1;
//	//11111111储存
//	//无符号数整形提升时补0
//	//打印0000000000000000000000011111111
//	printf("%d %d %d \n", a, b, c);
//	
//	return 0;
//}
// 
// 

//int get()
//{
//	int a = 1;
//	//char* p = (char*)&a;
//	return *(char*)&a;
//}
////指针类型决定解引用能访问几个字节
////指针类型*p+1跳过几个字节
//int main()
//{
//	int ret = get();
//	//返回1--小端
//	//返回0--大端
//	if (ret == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	char* p = (char* ) & a;
//	//20
//	//0x00 00 00 14
//	//0x14 00 00 00
//	//*p = 14 != 1
//
//	if (*p == 1)
//		printf("小端存储\n");
//	else
//		printf("大端存储\n");
//	return 0;
//}


//大小端模式
//0x11223344
//大端模式：高位存低位，低位存高位  0x11223344
//小端模式：低位存低位，高位存高位 0x44332211
//int main()
//{
//	int a=0x11223344;
//	//小端存储
//
//	return 0;
//}
// 无符号数 正数原反补码相同
//负数原码第一位为一，
//反码是原码符号位不变，其他位按位取反
//补码是反码加一
// 有符号数的存储是原反补，float double不行
//整形整数内存存储的是补码
//int main()
//{
//	int a = 20;
//	int b = -10;
//	//unsigned float c=10;
//
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	float b = 10.0;
//
//	return 0;
//}
